<h1>Introduction</h1>

<p> Cette s&eacute;rie de 14 cours est consacr&eacute;e &agrave; la
programmation sur plateformes mobiles. Elle se focalise principalement sur iOS
et montre &eacute;galement la correspondance des principes vus pour iOS sur
Android. Des &eacute;tudiants de M2 constituent le public vis&eacute; par ces
cours. On consid&egrave;re qu&#x27;ils sont d&eacute;j&agrave;
comp&eacute;tent en programmation et qu&#x27;ils ont des notions sur
l&#x27;utilisation de langages objets, de langages proc&eacute;duraux, ainsi
que des principes de base en syst&egrave;me d&#x27;exploitation
(interruptions, notion d&#x27;&eacute;v&eacute;nement, etc.).

<p>Les cours abordent successivement les principaux m&eacute;canismes offerts
par iOS pour le d&eacute;veloppement d&#x27;applications embarqu&eacute;es sur
des terminaux mobiles de type &laquo;smartphone&raquo; ou &laquo;tablettes&raquo;: l&#x27;environnement de
d&eacute;veloppement, la notion de vue, les principaux frameworks, etc. Un
parall&egrave;le avec la probl&eacute;matique du d&eacute;veloppement de
syst&egrave;mes embarqu&eacute;s est &eacute;galement fait.</p>

<p>Android est abord&eacute; au cours des trois derni&egrave;res semaines par rapport &agrave;
iOS sachant que les concepts sont extr&ecirc;mement voisins. Le cours explique
comment sont mise en &oelig;uvre les notions dans le contexte de cet
environnement pr&eacute;cis.</p>

<p>&Agrave; l&#x27;issue de ces cours, les &eacute;tudiants sont autonomes et
capables de naviguer non seulement dans l&#x27;environnement de
d&eacute;veloppement d&#x27;Apple, mais aussi dans des environnements
similaires. Nous consid&eacute;rons cette ann&eacute;e, iOS 8 ainsi qu'Android
4.4 (KitKat).
</p>
<!-- et certains nouveaux concepts mis en &oelig;uvre dans la version XXX.</p> -->

<p>Vous trouverez ici l'ensemble des informations vous permettant de naviguer
dans le cours.</p>

<h2>Signal&eacute;tique</h2>

<p>Au sein de ce cours, Une signal&eacute;tique, r&eacute;sum&eacute;e dans le
tableau ci-apr&egrave;s, permet de classer les diff&eacute;rentes
s&eacute;quences propos&eacute;es.</p>

<div align="center">
<table class="legende-signaletique">
	<tr class=>
		<th class="carte">Sur les cartes</th>
		<th class="page">Ic&ocirc;ne dans les pages</th>
		<th class="explication">Signification</th>
	</tr>
	<tr class="impair">
		<td class="carte">S&eacute;quence indiqu&eacute;e sur fond rouge</th>
		<td class="page"><img src="images/seq-basex50.png"></th>
		<td class="explication">Pr&eacute;sentation de concepts de base</th>
	</tr>
	<tr>
		<td class="carte">S&eacute;quence indiqu&eacute;e sur fond vert</th>
		<td class="page"><img src="images/seq-optx50.png"></th>
		<td class="explication">Pr&eacute;sentation d'&eacute;l&eacute;ments optionnels (requiert un pr&eacute;requis indiqu&eacute; sur la page associ&eacute;e)</th>
	</tr>
	<tr class="impair">
		<td class="carte">S&eacute;quence indiqu&eacute;e sur fond bleu</th>
		<td class="page"><img src="images/seq-examplex50.png"></th>
		<td class="explication">Illustration des notions associ&eacute;es au moyen d'exemples</th>
	</tr>
	<tr>
		<td class="carte">S&eacute;quence indiqu&eacute;e sur fond violet</th>
		<td class="page"><img src="images/seq-demox50.png"></th>
		<td class="explication">D&eacute;monstration en ligne</th>
	</tr>
	<tr class="impair">
		<td class="carte">S&eacute;quence indiqu&eacute;e sur fond orange</th>
		<td class="page"><img src="images/seq-exox50.png"></th>
		<td class="explication">Pr&eacute;sentation des exercices &agrave; faire</th>
	</tr>
</table>
</div>

<h2>Cartographie g&eacute;n&eacute;rale de ce cours</h2>

<p>La &laquo;carte g&eacute;n&eacute;rale&raquo; de ce cours vous permettra de
naviguer au travers des s&eacute;quences propos&eacute;es tout au long de cet
enseignement (cliquez sur une s&eacute;quence pour l&#x27;atteindre). Notez que vous
trouverez aussi des &laquo;cartes locales&raquo;, semaine par semaine, dans la
page d&eacute;di&eacute;e &agrave; chacune des s&eacute;ances de cet
enseignement.</p>


<p>Vous trouverez ici:</p> 

<ul>

<li> <a href="pdf/cartographie.pdf">une version pdf de la carte
g&eacute;n&eacute;rale du cours</a>,</li>

<li><a href="svg/cartographie.svg">une version svg de la carte
g&eacute;n&eacute;rale du cours</a>.</li>
	
</ul>
